# Ultralytics YOLO11s RGB+NIR BiFPN-only baseline with a light NIR branch (6-class person+rider merge).  # 模型定位：YOLO11s 双流 RGB+NIR，NIR 分支轻量化，类别口径为 6 类(person+rider 合并)
# Keeps the RGB branch unchanged, preserves the NIR P3 path, compresses the deeper NIR semantic stages,  # 设计要点1：RGB 主干保持不变；NIR 的浅层(P3)信息保留
# projects the lighter P4/P5 features back to the RGB fusion scale, and uses plain concat + BiFPN only.  # 设计要点2：NIR 深层(P4/P5)先压缩再投影回融合尺度，融合方式为 Concat + BiFPN

nc: 6  # nc=6：检测类别数为 6（使用 person+rider 合并后的标签体系）
scale: s  # scale=s：选择 scales 中 s 这一组深度/宽度缩放系数
scales:  # scales：不同模型尺寸对应的[depth_multiple, width_multiple, max_channels]
  n: [0.50, 0.25, 1024]  # n：深度系数0.50，宽度系数0.25，通道上限1024
  s: [0.50, 0.50, 1024]  # s：深度系数0.50，宽度系数0.50，通道上限1024（本文件实际使用）
  m: [0.50, 1.00, 512]  # m：深度系数0.50，宽度系数1.00，通道上限512
  l: [1.00, 1.00, 512]  # l：深度系数1.00，宽度系数1.00，通道上限512
  x: [1.00, 1.50, 512]  # x：深度系数1.00，宽度系数1.50，通道上限512

ch: 4  # ch=4：输入通道数为4（RGB三通道 + NIR一通道）
backbone:  # backbone：主干网络与中期融合路径
  - [-1, 1, nn.Identity, []]  # from=-1(接上一层/输入)；repeats=1(执行一次)；module=nn.Identity(恒等映射)；args=[](无参数)
  - [0, 1, SilenceChannel, [0, 3]]  # from=0(取第0层输出)；repeats=1；module=SilenceChannel(按通道切片)；args=[0,3](保留通道区间[0,3)，即RGB)
  - [-1, 1, Conv, [64, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[64,3,2](输出64通道，卷积核3，步长2，下采样)
  - [-1, 1, Conv, [128, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[128,3,2](输出128通道，继续下采样)
  - [-1, 2, C3k2, [256, False, 0.25]]  # from=-1；repeats=2；module=C3k2；args=[256,False,0.25](输出256通道，c3k开关False，扩展比0.25)
  - [-1, 1, Conv, [256, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[256,3,2](输出256通道，步长2)
  - [-1, 2, C3k2, [512, False, 0.25]]  # from=-1；repeats=2；module=C3k2；args=[512,False,0.25](RGB P3语义层，输出512)
  - [-1, 1, Conv, [512, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[512,3,2](下采样到更深尺度)
  - [-1, 2, C3k2, [512, True]]  # from=-1；repeats=2；module=C3k2；args=[512,True](RGB P4语义层，启用c3k分支)
  - [-1, 1, Conv, [1024, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[1024,3,2](下采样到最高语义尺度)
  - [-1, 2, C3k2, [1024, True]]  # from=-1；repeats=2；module=C3k2；args=[1024,True](RGB P5语义层)

  - [0, 1, SilenceChannel, [3, 4]]  # from=0；repeats=1；module=SilenceChannel；args=[3,4](保留通道区间[3,4)，即NIR单通道)
  - [-1, 1, Conv, [64, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[64,3,2](NIR分支stage1)
  - [-1, 1, Conv, [128, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[128,3,2](NIR分支stage2)
  - [-1, 2, C3k2, [256, False, 0.25]]  # from=-1；repeats=2；module=C3k2；args=[256,False,0.25](NIR浅层语义提取)
  - [-1, 1, Conv, [256, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[256,3,2](NIR下采样)
  - [-1, 2, C3k2, [512, False, 0.25]]  # from=-1；repeats=2；module=C3k2；args=[512,False,0.25](NIR P3语义层，保持与RGB P3对齐能力)
  - [-1, 1, Conv, [256, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[256,3,2](轻量化开始：深层先压到256)
  - [-1, 2, C3k2, [256, True]]  # from=-1；repeats=2；module=C3k2；args=[256,True](轻量NIR P4语义层)
  - [-1, 1, Conv, [512, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[512,3,2](进一步下采样)
  - [-1, 2, C3k2, [512, True]]  # from=-1；repeats=2；module=C3k2；args=[512,True](轻量NIR P5语义层)

  - [18, 1, Conv, [512, 1, 1]]  # from=18(NIR轻量P4)；repeats=1；module=Conv；args=[512,1,1](1x1投影回512通道，便于与RGB P4拼接)
  - [20, 1, Conv, [1024, 1, 1]]  # from=20(NIR轻量P5)；repeats=1；module=Conv；args=[1024,1,1](1x1投影回1024通道，便于与RGB P5拼接)
  - [[6, 16], 1, Concat, [1]]  # from=[6,16](RGB P3 + NIR P3)；repeats=1；module=Concat；args=[1](沿通道维dim=1拼接)
  - [[8, 21], 1, Concat, [1]]  # from=[8,21](RGB P4 + 投影后NIR P4)；repeats=1；module=Concat；args=[1](通道拼接)
  - [[10, 22], 1, Concat, [1]]  # from=[10,22](RGB P5 + 投影后NIR P5)；repeats=1；module=Concat；args=[1](通道拼接)
  - [-1, 1, SPPF, [1024, 5]]  # from=-1；repeats=1；module=SPPF；args=[1024,5](输出1024通道，池化核5，扩大感受野)
  - [-1, 2, C2PSA, [1024]]  # from=-1；repeats=2；module=C2PSA；args=[1024](注意力增强与语义重整)

  - [[23, 24, 27], 1, BiFPN, [256, 2]]  # from=[23,24,27](三尺度融合输入)；repeats=1；module=BiFPN；args=[256,2](统一输出通道256，BiFPN重复2次)
  - [28, 1, Index, [256, 0]]  # from=28(BiFPN输出列表)；repeats=1；module=Index；args=[256,0](取第0个尺度特征，声明通道256)
  - [28, 1, Index, [256, 1]]  # from=28；repeats=1；module=Index；args=[256,1](取第1个尺度特征，声明通道256)
  - [28, 1, Index, [256, 2]]  # from=28；repeats=1；module=Index；args=[256,2](取第2个尺度特征，声明通道256)

head:  # head：检测头（上采样+跨层拼接+三尺度Detect）
  - [31, 1, nn.Upsample, [None, 2, "nearest"]]  # from=31(最高层BiFPN特征)；repeats=1；module=nn.Upsample；args=[None,2,"nearest"](放大2倍，最近邻)
  - [[-1, 30], 1, Concat, [1]]  # from=[-1,30](上采样结果 + 中层BiFPN特征)；repeats=1；module=Concat；args=[1](通道拼接)
  - [-1, 2, C3k2, [256, False]]  # from=-1；repeats=2；module=C3k2；args=[256,False](融合后细化，中层语义)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # from=-1；repeats=1；module=nn.Upsample；args=[None,2,"nearest"](再上采样到更高分辨率)
  - [[-1, 29], 1, Concat, [1]]  # from=[-1,29](上采样结果 + 低层BiFPN特征)；repeats=1；module=Concat；args=[1](通道拼接)
  - [-1, 2, C3k2, [256, False]]  # from=-1；repeats=2；module=C3k2；args=[256,False](形成小目标检测分支特征)
  - [-1, 1, Conv, [256, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[256,3,2](下采样回中尺度)
  - [[-1, 34], 1, Concat, [1]]  # from=[-1,34](当前中尺度 + 先前中尺度分支)；repeats=1；module=Concat；args=[1]
  - [-1, 2, C3k2, [256, False]]  # from=-1；repeats=2；module=C3k2；args=[256,False](形成中目标检测分支特征)
  - [-1, 1, Conv, [256, 3, 2]]  # from=-1；repeats=1；module=Conv；args=[256,3,2](下采样回高语义尺度)
  - [[-1, 31], 1, Concat, [1]]  # from=[-1,31](当前高尺度 + BiFPN高尺度)；repeats=1；module=Concat；args=[1]
  - [-1, 2, C3k2, [256, True]]  # from=-1；repeats=2；module=C3k2；args=[256,True](形成大目标检测分支特征)
  - [[37, 40, 43], 1, Detect, [nc]]  # from=[37,40,43](小/中/大三尺度特征)；repeats=1；module=Detect；args=[nc](按6类输出检测框)
