# YOLO11s RGB+NIR BiFPN-only + Light NIR branch + true P2-P5 BiFPN
# + P2-only multi-scale OA soft-prior, c256 variant.
# Based on yolo11s_rgbnir_bifpn_p2p5_light_nir_oa_ms_softprior_c256_6cls_personmerge.yaml:
# - keeps RGB full branch, Light NIR branch, BiFPNP2P5 width 256, and four-scale Detect unchanged
# - keeps multi-scale NIR smoothing at P2/P3 for luminance/reflectance separation
# - applies soft bbox-prior auxiliary loss only at P2, with lambda=0.01
# - leaves P3 object-aware but unsupervised, avoiding the previous P3 soft-prior constraint
# - keeps P4/P5 plain concat to avoid over-gating high-level semantic features

nc: 6
scale: s
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

ch: 4
backbone:
  - [-1, 1, nn.Identity, []]
  - [0, 1, SilenceChannel, [0, 3]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]

  - [0, 1, SilenceChannel, [3, 4]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]

  - [18, 1, Conv, [512, 1, 1]]
  - [20, 1, Conv, [1024, 1, 1]]
  - [[4, 14], 1, ObjectAwareMultiScaleSoftPriorGateConcat, [1, 4, 0.01]]
  - [[6, 16], 1, ObjectAwareMultiScaleReflectanceGateConcat, [1, 4]]
  - [[8, 21], 1, Concat, [1]]
  - [[10, 22], 1, Concat, [1]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

  - [[23, 24, 25, 28], 1, BiFPNP2P5, [256, 2]]
  - [29, 1, Index, [256, 0]]
  - [29, 1, Index, [256, 1]]
  - [29, 1, Index, [256, 2]]
  - [29, 1, Index, [256, 3]]

head:
  - [30, 2, C3k2, [256, False]]
  - [31, 2, C3k2, [256, False]]
  - [32, 2, C3k2, [256, False]]
  - [33, 2, C3k2, [256, True]]
  - [[34, 35, 36, 37], 1, Detect, [nc]]
