# YOLO11s RGB+NIR OA-only + Light NIR branch + four-scale P2-P5 head.
# Based on yolo11s_rgbnir_bifpn_p2p5_light_nir_oa_ms_softprior_p2only_c256_6cls_personmerge.yaml:
# - keeps RGB full branch and Light NIR branch unchanged
# - keeps the OA part identical to the full model: P2 soft-prior, P3 multi-scale OA-Reflect, P4/P5 plain concat
# - removes only BiFPNP2P5 and Index, then feeds the four fused scales directly to the c256 refine head

nc: 6
scale: s
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

ch: 4
backbone:
  - [-1, 1, nn.Identity, []]
  - [0, 1, SilenceChannel, [0, 3]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]

  - [0, 1, SilenceChannel, [3, 4]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]

  - [18, 1, Conv, [512, 1, 1]]
  - [20, 1, Conv, [1024, 1, 1]]
  - [[4, 14], 1, ObjectAwareMultiScaleSoftPriorGateConcat, [1, 4, 0.1]]
  - [[6, 16], 1, ObjectAwareMultiScaleReflectanceGateConcat, [1, 4]]
  - [[8, 21], 1, Concat, [1]]
  - [[10, 22], 1, Concat, [1]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [23, 2, C3k2, [256, False]]
  - [24, 2, C3k2, [256, False]]
  - [25, 2, C3k2, [256, False]]
  - [28, 2, C3k2, [256, True]]
  - [[29, 30, 31, 32], 1, Detect, [nc]]
