# YOLO11s RGB+NIR BiFPN-only + Light NIR branch + P2 small-object head.
# Compared with yolo11s_rgbnir_bifpn_only_light_nir_6cls_personmerge.yaml:
# - keeps RGB backbone unchanged
# - keeps the existing light NIR P4/P5 compression
# - keeps the 3-scale P3/P4/P5 BiFPN unchanged
# - adds a lightweight stride-4 P2 detection branch for small objects

nc: 6
scale: s
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

ch: 4
backbone:
  - [-1, 1, nn.Identity, []]
  - [0, 1, SilenceChannel, [0, 3]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]

  - [0, 1, SilenceChannel, [3, 4]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]

  - [18, 1, Conv, [512, 1, 1]]
  - [20, 1, Conv, [1024, 1, 1]]
  - [[6, 16], 1, Concat, [1]]
  - [[8, 21], 1, Concat, [1]]
  - [[10, 22], 1, Concat, [1]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

  - [[23, 24, 27], 1, BiFPN, [256, 2]]
  - [28, 1, Index, [256, 0]]
  - [28, 1, Index, [256, 1]]
  - [28, 1, Index, [256, 2]]

head:
  - [31, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 30], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 29], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  # P2 small-object branch: P3 top-down feature + RGB/NIR shallow P2 details.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 37], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 34], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 31], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]
  - [[40, 43, 46, 49], 1, Detect, [nc]]
