# YOLO11s RGB+NIR OA + Light NIR branch + YOLO PAN-style P2-P5 head.
# Compared with yolo11s_rgbnir_oa_only_light_nir_p2p5_c256_6cls_personmerge.yaml:
# - keeps the OA fusion part unchanged: P2 soft-prior, P3 OA-Reflect, P4/P5 plain concat
# - removes BiFPNP2P5
# - replaces the direct refine-only head with a YOLO-style top-down and bottom-up PAN head
# - keeps four-scale P2/P3/P4/P5 Detect for small-object sensitivity

nc: 6
scale: s
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

ch: 4
backbone:
  - [-1, 1, nn.Identity, []]
  - [0, 1, SilenceChannel, [0, 3]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]

  - [0, 1, SilenceChannel, [3, 4]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]

  - [18, 1, Conv, [512, 1, 1]]
  - [20, 1, Conv, [1024, 1, 1]]
  - [[4, 14], 1, ObjectAwareMultiScaleSoftPriorGateConcat, [1, 4, 0.1]]
  - [[6, 16], 1, ObjectAwareMultiScaleReflectanceGateConcat, [1, 4]]
  - [[8, 21], 1, Concat, [1]]
  - [[10, 22], 1, Concat, [1]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [28, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 25], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 24], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 23], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 34], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 31], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 28], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [[37, 40, 43, 46], 1, Detect, [nc]]
