# YOLO11s RGB+NIR + Light NIR branch + P3-P5 BiFPN c256 r2.
# Explicit P3-P5 BiFPN-only baseline without the YOLO PAN head.

nc: 6
scale: s
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

ch: 4
backbone:
  - [-1, 1, nn.Identity, []]
  - [0, 1, SilenceChannel, [0, 3]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]

  - [0, 1, SilenceChannel, [3, 4]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]

  - [18, 1, Conv, [512, 1, 1]]
  - [20, 1, Conv, [1024, 1, 1]]
  - [[6, 16], 1, Concat, [1]]
  - [[8, 21], 1, Concat, [1]]
  - [[10, 22], 1, Concat, [1]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

  - [[23, 24, 27], 1, BiFPN, [256, 2]]
  - [28, 1, Index, [256, 0]]
  - [28, 1, Index, [256, 1]]
  - [28, 1, Index, [256, 2]]

head:
  - [29, 2, C3k2, [256, False]]
  - [30, 2, C3k2, [256, False]]
  - [31, 2, C3k2, [256, True]]
  - [[32, 33, 34], 1, Detect, [nc]]
